Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# AdvancedSetting.tabFlashAnimationDuration
source: Animation duration for fade in/out animation of tabs in full screen, in seconds.
de: Dauer der Ein-/Ausblendanimation von Tabs im Vollbildmodus, in Sekunden.
ja: フルスクリーンでのタブのフェードイン／アウトアニメーションの長さ（秒）。
pt_br: Duração da animação de fade in/out das abas em tela cheia, em segundos.
ru: Длительность анимации появления/исчезновения вкладок в полноэкранном режиме, в секундах.
zh_hans: 全屏标签页淡入淡出动画的持续时间（以秒为单位）。

# AdvancedSetting.tabsWrapAround
source: Tabs wrap around to the next line. This is useful for preserving tabs for later copying to the pasteboard. It breaks backward compatibility and may cause layout problems with programs that don’t expect this behavior.
de: Tabulatoren brechen in die nächste Zeile um. Dies ist nützlich, um Tabulatoren für ein späteres Kopieren in die Zwischenablage zu erhalten. Es bricht die Abwärtskompatibilität und kann bei Programmen, die dieses Verhalten nicht erwarten, zu Layout-Problemen führen.
ja: タブを次の行に折り返す。 これはタブを後でクリップボードにコピーするために保持するのに便利です。後方互換性を損ない、この動作を想定していないプログラムでレイアウトの問題を引き起こす可能性があります。
pt_br: As tabulações passam para a próxima linha. Isso é útil para preservar tabulações para copiar posteriormente para a área de transferência. Isso quebra a compatibilidade retroativa e pode causar problemas de layout com programas que não esperam esse comportamento.
ru: Символы табуляции переносятся на следующую строку. Это полезно для сохранения табуляций при последующем копировании в буфер обмена. Это нарушает обратную совместимость и может вызывать проблемы с раскладкой у программ, не рассчитанных на такое поведение.
zh_hans: 标签页会环绕到下一行。 此功能有助于保存标签页以便后续复制到粘贴区，但会破坏向后兼容性，并可能导致不期望的布局问题。

# AdvancedSetting.tabTitlesUseSmartTruncation
source: Use “smart truncation” for tab titles. If a tab‘s title is too long to fit, ellipsize the start of the title if more tabs have unique suffixes than prefixes in a given window.
de: „Intelligente Kürzung“ für Tab-Titel verwenden. Wenn der Titel eines Tabs zu lang ist, um zu passen, wird der Anfang des Titels mit Auslassungspunkten gekürzt, sofern in einem Fenster mehr Tabs eindeutige Suffixe als Präfixe haben.
ja: タブタイトルに「スマート短縮」を使用する。 タブのタイトルが長すぎて収まらない場合、あるウィンドウ内で、接頭辞よりも一意な接尾辞を持つタブが多ければ、タイトルの先頭を省略記号にします。
pt_br: Usar “truncamento inteligente” para os títulos das abas. Se o título de uma aba for longo demais para caber, abreviar o início do título se, em uma dada janela, mais abas tiverem sufixos únicos do que prefixos.
ru: Использовать «умное усечение» для заголовков вкладок. Если заголовок вкладки слишком длинный, чтобы поместиться, усекать многоточием начало заголовка, если в данном окне у вкладок больше уникальных суффиксов, чем префиксов.
zh_hans: 是否应使用“智能截断”处理标签页标题？ 若某个标签页的标题过长无法显示，且特定窗口中唯一后缀多于前缀时，可对标题开头进行省略处理。

# AdvancedSetting.throttleMetalConcurrentFrames
source: Reduce number of frames in flight when GPU can't produce drawables quickly.
de: Anzahl gleichzeitig verarbeiteter Frames reduzieren, wenn die GPU nicht schnell genug Drawables erzeugen kann.
ja: GPUがすばやくdrawableを生成できない場合、実行中のフレーム数を減らす。
pt_br: Reduzir o número de quadros em processamento quando a GPU não conseguir produzir drawables rapidamente.
ru: Уменьшать число одновременно обрабатываемых кадров, когда GPU не успевает быстро создавать drawable-объекты.
zh_hans: 减少GPU无法快速生成绘制内容时的飞行帧数。

# AdvancedSetting.timeBetweenBlinks
source: Cursor blink speed (seconds).
de: Blinkgeschwindigkeit des Cursors (Sekunden).
ja: カーソルの点滅速度（秒）。
pt_br: Velocidade de piscar do cursor (segundos).
ru: Скорость мигания курсора (в секундах).
zh_hans: 光标闪烁速度（秒）。

# AdvancedSetting.timeBetweenTips
source: Time between tips (in seconds)
de: Zeit zwischen Tipps (in Sekunden)
ja: ヒント表示の間隔（秒）
pt_br: Tempo entre dicas (em segundos)
ru: Промежуток между советами (в секундах)
zh_hans: 提示符之间的时间间隔（秒）

# AdvancedSetting.timeoutForDaemonAttachment
source: How long to wait when trying to attach to an iTerm daemon at startup when restoring windows (in seconds)?
de: Wie lange beim Start gewartet werden soll, um sich beim Wiederherstellen von Fenstern mit einem iTerm-Daemon zu verbinden (in Sekunden)?
ja: 起動時にウィンドウを復元する際、iTermデーモンへの接続を試みる待機時間は何秒ですか？
pt_br: Quanto tempo esperar ao tentar se conectar a um daemon do iTerm na inicialização ao restaurar janelas (em segundos)?
ru: Сколько секунд ждать при попытке подключиться к демону iTerm при запуске во время восстановления окон?
zh_hans: 在启动时恢复窗口时，等待iTerm守护进程连接时的等待时间（秒）。

# AdvancedSetting.timeoutForStringEvaluation
source: Timeout (seconds) for evaluating RPCs. This applies to invoking functions registered by scripts when using the Swift syntax for inline expressions.
de: Timeout (Sekunden) für die Auswertung von RPCs. Dies gilt für den Aufruf von Funktionen, die von Skripten registriert wurden, wenn die Swift-Syntax für Inline-Ausdrücke verwendet wird.
ja: RPCを評価する際のタイムアウト（秒）。 これは、インライン式にSwift構文を使用する際にスクリプトが登録した関数を呼び出す場合に適用されます。
pt_br: Tempo limite (segundos) para avaliar RPCs. Isso se aplica à invocação de funções registradas por scripts ao usar a sintaxe Swift para expressões inline.
ru: Тайм-аут (в секундах) для вычисления RPC. Применяется при вызове функций, зарегистрированных скриптами, если используется синтаксис Swift для встроенных выражений.
zh_hans: 评估RPCs的超时时间（秒）。 此规则适用于使用Swift内联表达式语法时由脚本注册的函数调用。

# AdvancedSetting.timeToWaitForEmojiPanel
source: How long to wait for the emoji panel to open in seconds? Floating hotkey windows adjust their level when the emoji panel is open. If it’s really slow you might need to increase this value to prevent it from appearing beneath a floating hotkey window.
de: Wie lange in Sekunden auf das Öffnen des Emoji-Fensters gewartet werden soll? Schwebende Hotkey-Fenster passen ihre Ebene an, wenn das Emoji-Fenster geöffnet ist. Falls es sehr langsam ist, müssen Sie diesen Wert eventuell erhöhen, damit es nicht hinter einem schwebenden Hotkey-Fenster erscheint.
ja: 絵文字パネルが開くまで何秒待ちますか？ フローティングホットキーウィンドウは、絵文字パネルが開いている間そのレベルを調整します。動作が非常に遅い場合、フローティングホットキーウィンドウの下に表示されるのを防ぐため、この値を増やす必要があるかもしれません。
pt_br: Quanto tempo esperar para o painel de emoji abrir, em segundos? Janelas de hotkey flutuantes ajustam seu nível quando o painel de emoji está aberto. Se estiver muito lento, talvez você precise aumentar este valor para evitar que ele apareça atrás de uma janela de hotkey flutuante.
ru: Сколько секунд ждать открытия панели эмодзи? Плавающие окна горячих клавиш меняют свой уровень, когда панель эмодзи открыта. Если это происходит очень медленно, может понадобиться увеличить это значение, чтобы панель не оказалась под плавающим окном горячих клавиш.
zh_hans: 表情符号面板打开所需的等待时间（秒）。 浮动热键窗口在表情符号面板打开时会调整层级。如果操作非常慢，可能需要提高此值以避免其在浮动热键窗口下方显示。

# AdvancedSetting.tmuxIncludeClientNameInWindowTitle
source: When using tmux integration, should the tmux client name (typically the name of the attaching session or the host name) appear in brackets in the window title?
de: Soll bei Verwendung der tmux-Integration der tmux-Client-Name (in der Regel der Name der verbindenden Sitzung oder der Hostname) in Klammern im Fenstertitel erscheinen?
ja: tmux統合を使用する場合、tmuxクライアント名（通常は接続先セッション名またはホスト名）をウィンドウタイトルに角括弧で表示しますか？
pt_br: Ao usar a integração com tmux, o nome do cliente tmux (normalmente o nome da sessão que se conecta ou o nome do host) deve aparecer entre colchetes no título da janela?
ru: Показывать ли имя клиента tmux (обычно это имя подключаемого сеанса или имя хоста) в квадратных скобках в заголовке окна при использовании интеграции с tmux?
zh_hans: 使用tmux集成时，tmux客户端名称（通常是连接会话或主机名）是否应出现在窗口标题的方括号中？

# AdvancedSetting.tmuxTitlePrefix
source: Insert this string at the start of tab and window titles to indicate tmux integration.
de: Diese Zeichenfolge am Anfang von Tab- und Fenstertiteln einfügen, um die tmux-Integration anzuzeigen.
ja: tmux統合であることを示すため、タブおよびウィンドウタイトルの先頭にこの文字列を挿入します。
pt_br: Inserir esta string no início dos títulos de abas e janelas para indicar a integração com tmux.
ru: Вставлять эту строку в начало заголовков вкладок и окон, чтобы указать на интеграцию с tmux.
zh_hans: 在tab和窗口标题开头插入此字符串，以表示tmux集成。

# AdvancedSetting.tmuxVariableWindowSizesSupported
source: Allow variable window sizes in tmux integration. Requres tmux version 2.9 or later.
de: Variable Fenstergrößen in der tmux-Integration zulassen. Erfordert tmux Version 2.9 oder neuer.
ja: tmux統合で可変ウィンドウサイズを許可します。 tmuxバージョン2.9以降が必要です。
pt_br: Permitir tamanhos de janela variáveis na integração com tmux. Requer o tmux versão 2.9 ou posterior.
ru: Разрешить переменные размеры окон при интеграции с tmux. Требуется tmux версии 2.9 или новее.
zh_hans: 允许在tmux集成中使用可变窗口大小。 需要tmux版本2.9或更高版本。

# AdvancedSetting.tmuxWindowsOpenInBackground
source: Open tmux windows and tabs in the background? When enabled, attaching with tmux -CC (or when tmux creates a new window) will reveal the window or tab without moving keyboard focus to it. Focus stays on the attaching session.
de: tmux-Fenster und -Tabs im Hintergrund öffnen? Wenn aktiviert, wird beim Verbinden mit tmux -CC (oder wenn tmux ein neues Fenster erstellt) das Fenster oder der Tab angezeigt, ohne den Tastaturfokus dorthin zu verschieben. Der Fokus bleibt auf der verbindenden Sitzung.
ja: tmuxのウィンドウとタブをバックグラウンドで開きますか？ 有効にすると、tmux -CCで接続したとき（またはtmuxが新しいウィンドウを作成したとき）に、キーボードフォーカスを移動せずにウィンドウまたはタブを表示します。フォーカスは接続元のセッションに留まります。
pt_br: Abrir janelas e abas do tmux em segundo plano? Quando ativado, conectar-se com tmux -CC (ou quando o tmux cria uma nova janela) revelará a janela ou aba sem mover o foco do teclado para ela. O foco permanece na sessão que se conecta.
ru: Открывать окна и вкладки tmux в фоновом режиме? Если включено, при подключении с помощью tmux -CC (или когда tmux создаёт новое окно) окно или вкладка появятся без переноса на них фокуса клавиатуры. Фокус останется на подключаемом сеансе.
zh_hans: 是否在后台打开tmux窗口和标签页？ 如果启用，使用tmux -CC连接或tmux创建新窗口时，无需移动键盘焦点即可显示该窗口或标签页。焦点仍保留在连接会话上。

# AdvancedSetting.tmuxWindowsShouldCloseAfterDetach
source: Close tmux windows after detaching? This only takes effect when “Settings > Profiles > Session > After a session ends” is set to “No Action”.
de: tmux-Fenster nach dem Trennen schließen? Dies wirkt sich nur aus, wenn „Einstellungen > Profile > Sitzung > Nach Ende einer Sitzung“ auf „Keine Aktion“ gesetzt ist.
ja: デタッチ後にtmuxウィンドウを閉じますか？ これは「設定 > プロファイル > セッション > セッション終了後」が「何もしない」に設定されている場合にのみ有効です。
pt_br: Fechar janelas do tmux após desconectar? Isso só tem efeito quando “Ajustes > Perfis > Sessão > Após uma sessão terminar” estiver definido como “Nenhuma ação”.
ru: Закрывать окна tmux после отключения? Действует только если в разделе «Настройки > Профили > Сеанс > После завершения сеанса» выбрано значение «Нет действия».
zh_hans: 断开连接后是否关闭tmux窗口？ 此设置仅在“设置 > 配置文件 > 会话 > 会话结束后”设置为“无操作”时生效。

# AdvancedSetting.tolerateUnrecognizedTmuxCommands
source: Tolerate unrecognized commands from server. If disabled, an unknown command from tmux (such as output from ssh or wall) will end the session. Turning this off helps detect dead ssh sessions.
de: Nicht erkannte Befehle vom Server tolerieren. Wenn deaktiviert, beendet ein unbekannter Befehl von tmux (z. B. Ausgabe von ssh oder wall) die Sitzung. Das Deaktivieren hilft, tote SSH-Sitzungen zu erkennen.
ja: サーバーからの未知のコマンドを許容します。 無効にすると、tmuxからの未知のコマンド（sshやwallからの出力など）を受け取るとセッションが終了します。これをオフにすると、切断されたsshセッションを検出しやすくなります。
pt_br: Tolerar comandos não reconhecidos do servidor. Se desativado, um comando desconhecido do tmux (como a saída de ssh ou wall) encerrará a sessão. Desativar isto ajuda a detectar sessões ssh mortas.
ru: Допускать нераспознанные команды от сервера. Если отключено, неизвестная команда от tmux (например, вывод от ssh или wall) завершит сеанс. Отключение этого параметра помогает обнаруживать «мёртвые» сеансы ssh.
zh_hans: 允许服务器发送无法识别的命令。 如果禁用，tmux中的未知命令（如ssh或wall的输出）将终止会话。关闭此选项有助于检测死掉的ssh会话。

# AdvancedSetting.toolbeltFont
source: Toolbelt font family name
de: Schriftfamilie des Toolbelt
ja: ツールベルトのフォントファミリー名
pt_br: Nome da família de fontes da Caixa de ferramentas
ru: Название семейства шрифта панели инструментов
zh_hans: Toolbelt字体家族名称

# AdvancedSetting.toolbeltFontSize
source: Toolbelt font size in points. Set to 0 to use the system default. Changing this setting does not affect existing windows.
de: Schriftgröße des Toolbelt in Punkten. Auf 0 setzen, um die Systemvorgabe zu verwenden. Das Ändern dieser Einstellung wirkt sich nicht auf bestehende Fenster aus.
ja: ツールベルトのフォントサイズ（ポイント単位）。 システムのデフォルトを使用するには0に設定してください。この設定を変更しても、既存のウィンドウには影響しません。
pt_br: Tamanho da fonte da Caixa de ferramentas em pontos. Defina como 0 para usar o padrão do sistema. Alterar este ajuste não afeta janelas existentes.
ru: Размер шрифта панели инструментов в пунктах. Установите 0, чтобы использовать системное значение по умолчанию. Изменение этого параметра не влияет на уже открытые окна.
zh_hans: Toolbelt字体大小（点）。 设置为0则使用系统默认。更改此设置不会影响现有窗口。

# AdvancedSetting.trackingRunloopForLiveResize
source: Use a tracking runloop for live resizing. This allows the terminal to redraw during a resizing drag.
de: Tracking-Runloop für die Größenänderung in Echtzeit verwenden. Dies ermöglicht dem Terminal, sich während eines Größenänderungsvorgangs neu zu zeichnen.
ja: ライブリサイズ時にトラッキングランループを使用します。 これにより、リサイズのドラッグ中でもターミナルが再描画されます。
pt_br: Usar um runloop de rastreamento para redimensionamento ao vivo. Isso permite que o terminal redesenhe durante um arraste de redimensionamento.
ru: Использовать tracking runloop для обновления экрана в реальном времени при изменении размера. Это позволяет терминалу перерисовываться во время перетаскивания при изменении размера.
zh_hans: 使用跟踪运行循环进行实时调整大小。 这允许终端在调整大小拖拽过程中重新绘制。

# AdvancedSetting.traditionalVisualBell
source: Visual bell flashes the whole screen, not just a bell icon.
de: Der visuelle Signalton lässt den gesamten Bildschirm aufblitzen, nicht nur ein Glockensymbol.
ja: ビジュアルベルは、ベルアイコンだけでなく画面全体を点滅させます。
pt_br: A campainha visual pisca a tela inteira, não apenas um ícone de campainha.
ru: Визуальный сигнал мигает всем экраном, а не только значком колокольчика.
zh_hans: 视觉铃铛会全屏闪烁，而不仅仅是铃铛图标。

# AdvancedSetting.trailingPunctuationMarks
source: Characters to ignore at the end of a URL
de: Zeichen, die am Ende einer URL ignoriert werden sollen
ja: URLの末尾で無視する文字
pt_br: Caracteres a ignorar no final de uma URL
ru: Символы, которые нужно игнорировать в конце URL
zh_hans: URL末尾需要忽略的字符

# AdvancedSetting.translateScreenToXterm
source: Support TERM=screen Most notably, this fixes italics replacing inverse text.
de: TERM=screen unterstützen Insbesondere behebt dies, dass Kursivschrift invertierten Text ersetzt.
ja: TERM=screenをサポート 特に、イタリック体が反転表示の代わりに使われる問題を修正します。
pt_br: Suportar TERM=screen Mais notavelmente, isso corrige o itálico substituindo o texto invertido.
ru: Поддержка TERM=screen В первую очередь это исправляет замену инверсного текста курсивом.
zh_hans: 支持TERM=screen 最显著的是，这解决了反斜线文本的斜体问题。

# AdvancedSetting.triggerRadius
source: Number of screen lines to match against trigger regular expressions. Trigger regular expressions are matched against the last logical line of text when a newline is received. A search is performed to find the start of the line. Since very long lines would cause performance problems, the search (and consequently the regular expression match, highlighting, and so on) is limited to this many screen lines.
de: Anzahl der Bildschirmzeilen, die gegen die regulären Ausdrücke der Trigger abgeglichen werden. Reguläre Ausdrücke von Triggern werden gegen die letzte logische Textzeile abgeglichen, wenn ein Zeilenumbruch empfangen wird. Es wird eine Suche durchgeführt, um den Anfang der Zeile zu finden. Da sehr lange Zeilen Leistungsprobleme verursachen würden, ist die Suche (und damit der Abgleich des regulären Ausdrucks, das Hervorheben usw.) auf diese Anzahl von Bildschirmzeilen begrenzt.
ja: トリガーの正規表現と照合する画面行数。 改行を受け取ると、トリガーの正規表現は最後の論理行のテキストと照合されます。行の先頭を見つけるために検索が行われます。非常に長い行はパフォーマンスの問題を引き起こすため、この検索（したがって正規表現の照合、ハイライト表示なども含む）は指定した画面行数までに制限されます。
pt_br: Número de linhas de tela a comparar com as expressões regulares de gatilho. As expressões regulares de gatilho são comparadas com a última linha lógica de texto quando uma quebra de linha é recebida. Uma busca é realizada para encontrar o início da linha. Como linhas muito longas causariam problemas de desempenho, a busca (e consequentemente a correspondência da expressão regular, o realce e assim por diante) é limitada a esta quantidade de linhas de tela.
ru: Количество экранных строк, которые нужно сопоставлять с регулярными выражениями триггеров. Регулярные выражения триггеров сопоставляются с последней логической строкой текста при получении символа новой строки. Выполняется поиск начала строки. Поскольку очень длинные строки могут привести к проблемам с производительностью, поиск (а вместе с ним и сопоставление регулярного выражения, подсветка и так далее) ограничен этим числом экранных строк.
zh_hans: 与触发正则表达式匹配的屏幕行数。 当收到换行符时，触发正则表达式会匹配最后逻辑文本行。进行搜索以定位行的开始位置。由于非常长的行会导致性能问题，搜索（以及相应的正则表达式匹配、高亮显示等）限制在这几行屏幕内。

# AdvancedSetting.trimWhitespaceOnCopy
source: Trim whitespace when copying to pasteboard.
de: Leerraum beim Kopieren in die Zwischenablage entfernen.
ja: ペーストボードにコピーする際に空白を除去します。
pt_br: Remover espaços em branco ao copiar para a área de transferência.
ru: Удалять пробельные символы при копировании в буфер обмена.
zh_hans: 复制到pasteboard时修剪空格。

# AdvancedSetting.typingClearsSelection
source: Pressing a key will remove the selection.
de: Das Drücken einer Taste hebt die Auswahl auf.
ja: キーを押すと選択が解除されます。
pt_br: Pressionar uma tecla removerá a seleção.
ru: Нажатие клавиши снимает выделение.
zh_hans: 按键将取消选择。

# AdvancedSetting.unameCommand
source: Command used to set the `uname` variable. The main use of this is to use in the AI prompt so the language model knows the operating system.
de: Befehl zum Setzen der Variable `uname`. Der Hauptzweck besteht darin, sie im KI-Prompt zu verwenden, damit das Sprachmodell das Betriebssystem kennt.
ja: `uname`変数を設定するために使用するコマンド。 主に、言語モデルがオペレーティングシステムを認識できるようAIプロンプトで使用するためのものです。
pt_br: Comando usado para definir a variável `uname`. O principal uso disto é no prompt de IA para que o modelo de linguagem saiba o sistema operacional.
ru: Команда, используемая для установки переменной `uname`. Основное назначение — использование в запросе к ИИ, чтобы языковая модель знала операционную систему.
zh_hans: 用于设置 `uname`变量的命令。 主要用途是在AI提示词中，以便语言模型了解操作系统。

# AdvancedSetting.underlineCursorHeight
source: Thickness of underline cursor.
de: Dicke des Unterstrich-Cursors.
ja: アンダーラインカーソルの太さ。
pt_br: Espessura do cursor de sublinhado.
ru: Толщина курсора-подчёркивания.
zh_hans: 下划线光标的厚度。

# AdvancedSetting.underlineCursorOffset
source: Vertical offset for underline cursor. Positive values move it up, negative values move it down.
de: Vertikaler Versatz für den Unterstrich-Cursor. Positive Werte verschieben ihn nach oben, negative Werte nach unten.
ja: アンダーラインカーソルの垂直方向のオフセット。 正の値では上に、負の値では下に移動します。
pt_br: Deslocamento vertical do cursor de sublinhado. Valores positivos o movem para cima, valores negativos o movem para baixo.
ru: Вертикальное смещение курсора-подчёркивания. Положительные значения перемещают его вверх, отрицательные — вниз.
zh_hans: 下划线光标的垂直偏移量。 正值向上移动，负值向下移动。

# AdvancedSetting.underlineHyperlinks
source: Underline OSC 8 hyperlinks
de: OSC-8-Hyperlinks unterstreichen
ja: OSC 8ハイパーリンクに下線を引く
pt_br: Sublinhar hyperlinks OSC 8
ru: Подчёркивать гиперссылки OSC 8
zh_hans: OSC 8超链接下的划线。

# AdvancedSetting.updateScreenParamsDelay
source: Delay after changing number of screens/resolution until refresh (seconds). This works around OS bugs where it takes some time after a screen change before it is safe to resize windows.
de: Verzögerung nach Änderung der Bildschirmanzahl/-auflösung bis zur Aktualisierung (Sekunden). Dies umgeht Betriebssystemfehler, bei denen es nach einer Bildschirmänderung eine gewisse Zeit dauert, bevor Fenster gefahrlos in der Größe geändert werden können.
ja: 画面数や解像度を変更してから再描画するまでの遅延（秒）。 これは、画面変更後にウィンドウのサイズ変更が安全になるまで時間がかかるというOSのバグを回避するためのものです。
pt_br: Atraso após alterar o número de telas/resolução até a atualização (segundos). Isso contorna erros do sistema em que leva algum tempo após uma mudança de tela antes de ser seguro redimensionar janelas.
ru: Задержка после изменения количества экранов или разрешения до обновления (в секундах). Это обходит ошибки ОС, из-за которых после изменения экрана требуется время, прежде чем можно безопасно изменять размер окон.
zh_hans: 更改屏幕数/分辨率后的刷新延迟时间（秒）。 针对操作系统中的漏洞，屏幕更换后需要一段时间才能安全调整窗口大小。

# AdvancedSetting.URLCharacterSet
source: Non-alphanumeric characters considered part of a URL or file name for Semantic History. Letters and numbers are always considered part of the URL. These non-alphanumeric characters are used in addition for the purposes of figuring out where a URL begins and ends. You must restart iTerm2 for changes to this setting to take effect.
de: Nicht alphanumerische Zeichen, die für die Semantic History als Teil einer URL oder eines Dateinamens gelten. Buchstaben und Zahlen gelten immer als Teil der URL. Diese nicht alphanumerischen Zeichen werden zusätzlich verwendet, um zu bestimmen, wo eine URL beginnt und endet. Sie müssen iTerm2 neu starten, damit Änderungen an dieser Einstellung wirksam werden.
ja: セマンティックヒストリーでURLまたはファイル名の一部とみなす英数字以外の文字。 文字と数字は常にURLの一部とみなされます。これらの英数字以外の文字は、URLの開始位置と終了位置を判断するために追加で使用されます。この設定の変更を反映させるにはiTerm2を再起動する必要があります。
pt_br: Caracteres não alfanuméricos considerados parte de uma URL ou nome de arquivo para o Semantic History. Letras e números são sempre considerados parte da URL. Estes caracteres não alfanuméricos são usados adicionalmente para determinar onde uma URL começa e termina. Você precisa reiniciar o iTerm2 para que as alterações desta configuração tenham efeito.
ru: Неалфавитно-цифровые символы, которые считаются частью URL-адреса или имени файла для функции «Смысловая история». Буквы и цифры всегда считаются частью URL-адреса. Эти неалфавитно-цифровые символы дополнительно используются для определения начала и конца URL-адреса. Чтобы изменения этого параметра вступили в силу, перезапустите iTerm2.
zh_hans: 非字母数字字符被视为URL或文件名的一部分，用于语义历史功能。 字母和数字始终视为URL的一部分。这些非字母数字字符还用于确定URL的起始和结束位置。必须重启iTerm2才能使此设置生效。

# AdvancedSetting.URLCharacterSetExclusions
source: Characters never considered part of a URL. The characters in this string may never occur in a URL; when one is seen that delineates the beginning or end of a URL.
de: Zeichen, die niemals als Teil einer URL gelten. Die Zeichen in dieser Zeichenfolge dürfen niemals in einer URL vorkommen; wird eines davon erkannt, markiert es den Anfang oder das Ende einer URL.
ja: URLの一部として決してみなされない文字。 この文字列に含まれる文字はURL中に現れることがないため、見つかった場合はURLの開始または終了の区切りとみなされます。
pt_br: Caracteres nunca considerados parte de uma URL. Os caracteres nesta string nunca podem ocorrer em uma URL; quando um deles aparece, ele delimita o início ou o fim de uma URL.
ru: Символы, которые никогда не считаются частью URL-адреса. Символы в этой строке никогда не встречаются в URL-адресе; когда такой символ обнаружен, он обозначает начало или конец URL-адреса.
zh_hans: 永远不会被视为URL字符的字符。 该字符串中的字符可能永远不会出现在URL中；当出现此类字符时，表示URL的起始或结束。
